IRP/src/Reports/PriceInfo/PriceInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
 <name>PriceInfo</name>
 <attributes>
  <name>PriceOwner</name>
  <type>
   <types>CatalogRef.Items</types>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>PricePeriod</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
</mdclass:Report>

IRP/src/InformationRegisters/PricesByItemKeys/PricesByItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>PricesByItemKeys</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Price</name>
  <type>
   <types>DefinedType.typePrice</types>
  </type>
 </resources>
 <resources>
  <name>InputUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>InputPrice</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/PricesByProperties/PricesByProperties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>PricesByProperties</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Price</name>
  <type>
   <types>DefinedType.typePrice</types>
  </type>
 </resources>
 <resources>
  <name>InputUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>InputPrice</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>PriceKey</name>
  <type>
   <types>CatalogRef.PriceKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/PricesByItems/PricesByItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>PricesByItems</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Price</name>
  <type>
   <types>DefinedType.typePrice</types>
  </type>
 </resources>
 <resources>
  <name>InputUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </resources>
 <resources>
  <name>InputPrice</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Item</name>
  <type>
   <types>DefinedType.typeItem</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/SpecificationType/SpecificationType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>SpecificationType</name>
 <enumValues>
  <name>Bundle</name>
 </enumValues>
 <enumValues>
  <name>Set</name>
 </enumValues>
 <enumValues>
  <name>BundleByItemKey</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Specifications/Specifications.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Specifications</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.SpecificationType</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemBundle</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>DataSet</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
    <types>CatalogRef.ItemTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>DataQuantity</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantityInSpecifications</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Specification</name>
  <type>
   <types>CatalogRef.Specifications</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultBillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </attributes>
 <attributes>
  <name>UseIncomingStockReservation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecificationAffectPricingMD5</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricingMD5</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PriceTypes/PriceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PriceTypes</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>ManualPriceType</name>
  </items>
  <items>
   <name>Default_Vendor</name>
  </items>
  <items>
   <name>Default_Customer</name>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>ExternalDataProc</name>
  <type>
   <types>CatalogRef.ExternalDataProc</types>
  </type>
 </attributes>
 <attributes>
  <name>ExternalDataProcSettings</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>Assignment</name>
  <type>
   <types>EnumRef.PriceAssignment</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PriceKeys/PriceKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PriceKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Reports/PriceInfo/ObjectModule.bsl
Procedure OnComposeResult(ResultDocument, DetailsData, StandardProcessing)
	StandardProcessing = False;
	
	TemplateComposer = New DataCompositionTemplateComposer();
	Settings = SettingsComposer.GetSettings();
	
	Settings.DataParameters.SetParameterValue("PricePeriod", 
				?(ValueIsFilled(PricePeriod), EndOfDay(PricePeriod), EndOfDay(CurrentDate())));
	
	ItemKeysArray = New Array();
	If TypeOf(PriceOwner) = Type("CatalogRef.ItemKeys") Then
		ItemKeysArray.Add(PriceOwner);
	ElsIf TypeOf(PriceOwner) = Type("CatalogRef.Items") Then
		ItemKeysArray = CatItemsServer.GetArrayOfItemKeysByItem(PriceOwner);
	Else
		Return;
	EndIf;
	
	Query = New Query(
	"SELECT ALLOWED
	|	Table.Ref AS ItemKey,
	|	PriceTypes.Ref AS PriceType,
	|	Table.Item AS Item,
	|	Table.Specification AS Specification,
	|	Table.AffectPricingMD5 AS AffectPricingMD5,
	|	CASE
	|		WHEN Table.Specification = VALUE(Catalog.Specifications.EmptyRef)
	|			THEN FALSE
	|		ELSE TRUE
	|	END AS IsSpecification
	|into tmp_ItemKeys
	|FROM
	|	Catalog.ItemKeys AS Table
	|		INNER JOIN Catalog.PriceTypes AS PriceTypes
	|			ON Not PriceTypes.DeletionMark
	|			AND CASE
	|					WHEN &PriceOwnerIsItem
	|						THEN Table.Item = &PriceOwner
	|					ELSE Table.Ref = &PriceOwner
	|				END
	|;
	|/////////////////////////////////////
	|SELECT
	|	1 AS Priority,
	|	&ByItemKeys AS PriceDefinitionType
	|into tmpPriceDefinitionTypes
	|
	|UNION ALL
	|
	|SELECT
	|	2 AS Priority,
	|	&ByProperties AS PriceTypeDefinition
	|
	|UNION ALL
	|
	|SELECT
	|	3 AS Priority,
	|	&ByItems AS PriceTypeDefinition
	|
	|UNION ALL
	|
	|SELECT
	|	0 AS Priority,
	|	"""" AS PriceTypeDefinition
	|
	|");
	Query.TempTablesManager = New TempTablesManager();
	Query.SetParameter("PricePeriod", ?(ValueIsFilled(PricePeriod), EndOfDay(PricePeriod), EndOfDay(CurrentDate())));
	
	Query.SetParameter("PriceOwner"      , PriceOwner);
	Query.SetParameter("PriceOwnerIsItem", TypeOf(PriceOwner) = Type("CatalogRef.Items"));
	
	Query.SetParameter("ByItemKeys"     , R().Form_022);
	Query.SetParameter("ByProperties"	, R().Form_023);
	Query.SetParameter("ByItems"		, R().Form_024);
	
	Query.Execute();
		
	Query.Text = GetQueryTextForSpecifications();
	Query.Execute();
	
	Query.Text = GetQueryTextForNotSpecifications();
	Query.Execute();
	
	Query.Text =
	"SELECT
	|	tmpPriceDefinitionTypes.Priority AS Priority,
	|	tmpPriceDefinitionTypes.PriceDefinitionType AS PriceDefinitionType,
	|	Table.PriceDefinitionReason AS PriceDefinitionReason,
	|	Table.Item AS Item,
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceType AS PriceType,
	|	Table.Price AS Price
	|into tmpAllPrices
	|FROM
	|	tmpPriceDefinitionTypes AS tmpPriceDefinitionTypes
	|		LEFT JOIN (SELECT
	|			Table.PriceDefinitionType AS PriceDefinitionType,
	|			Table.PriceDefinitionReason AS PriceDefinitionReason,
	|			Table.Item AS Item,
	|			Table.ItemKey AS ItemKey,
	|			Table.PriceType AS PriceType,
	|			Table.Price AS Price
	|		FROM
	|			tmp_Specification AS Table
	|
	|		UNION ALL
	|
	|		SELECT
	|			Table.PriceDefinitionType AS PriceDefinitionType,
	|			Table.PriceDefinitionReason AS PriceDefinitionReason,
	|			Table.Item AS Item,
	|			Table.ItemKey AS ItemKey,
	|			Table.PriceType AS PriceType,
	|			Table.Price AS Price
	|		FROM
	|			tmp_NotSpecification AS Table) AS Table
	|		ON Table.PriceDefinitionType = tmpPriceDefinitionTypes.PriceDefinitionType
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	MIN(Table.Priority) AS Priority,
	|	Table.Item AS Item,
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceType AS PriceType
	|into tmpPriorityPrices
	|FROM
	|	tmpAllPrices AS Table
	|WHERE
	|	NOT Table.Price IS NULL
	|GROUP BY
	|	Table.Item,
	|	Table.ItemKey,
	|	Table.PriceType
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	(NOT tmpPriorityPrices.Priority IS NULL) AS IsPriority,
	|	Table.PriceDefinitionType AS PriceDefinitionType,
	|	Table.PriceDefinitionReason AS PriceDefinitionReason,
	|	CASE
	|		WHEN Table.PriceDefinitionType = &ByItemKeys 
	|			THEN ""Item key = ""
	|		WHEN Table.PriceDefinitionType = &ByProperties 
	|			THEN ""Property = ""
	|		WHEN Table.PriceDefinitionType = &ByItems 
	|			THEN ""Item = ""
	|		WHEN Table.PriceDefinitionType = """" 
	|			THEN ""Specification""
	|		ELSE """"
	|	END AS PriceDefinitionReasonString,
	|	Table.Item AS Item,
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceType AS PriceType,
	|	Table.Price AS Price
	|FROM
	|	tmpAllPrices AS Table
	|		LEFT JOIN tmpPriorityPrices AS tmpPriorityPrices
	|		ON Table.Priority = tmpPriorityPrices.Priority
	|		AND Table.Item = tmpPriorityPrices.Item
	|		AND Table.ItemKey = tmpPriorityPrices.ItemKey
	|		AND Table.PriceType = tmpPriorityPrices.PriceType
	|";
	PriceInfoTable = Query.Execute().Unload();	
		
	///////////////////////////
	
	CompositionTemplate = TemplateComposer.Execute(DataCompositionSchema, Settings, DetailsData);

	DataSets = New Structure("PriceInfoTable", PriceInfoTable);
	
	Processor = New DataCompositionProcessor();
	Processor.Initialize(CompositionTemplate, DataSets, DetailsData, True);

	OutputProcessor = New DataCompositionResultSpreadsheetDocumentOutputProcessor();
	OutputProcessor.SetDocument(ResultDocument);

	OutputProcessor.Output(Processor, True);
		
EndProcedure

Function GetQueryTextForSpecifications()
	Return
	"SELECT
	|	Table.ItemKey AS ItemKey,
	|	Table.Item AS Item,
	|	Table.Specification AS Specification,
	|	ItemKeysSpecificationAffectPricingMD5.Key AS Key,
	|	ItemKeysSpecificationAffectPricingMD5.AffectPricingMD5 AS AffectPricingMD5,
	|	PriceTypes.Ref AS PriceType
	|INTO t_ItemKeys
	|FROM
	|	tmp_ItemKeys AS Table
	|		INNER JOIN Catalog.ItemKeys.SpecificationAffectPricingMD5 AS ItemKeysSpecificationAffectPricingMD5
	|		ON Table.ItemKey = ItemKeysSpecificationAffectPricingMD5.Ref
	|		AND Table.IsSpecification
	|
	|		LEFT JOIN Catalog.PriceTypes AS PriceTypes
	|		ON TRUE
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.ItemKey AS ItemKey,
	|	MAX(CASE
	|		WHEN Table.Specification.Type = VALUE(Enum.SpecificationType.Bundle)
	|			THEN SpecificationsDataSet.Item
	|		ELSE Table.Item
	|	END) AS Item,
	|	Table.Specification AS Specification,
	|	ISNULL(SpecificationsDataQuantity.Quantity, 0) AS Quantity,
	|	Table.Key AS Key,
	|	Table.PriceType AS PriceType,
	|	Table.AffectPricingMD5 AS AffectPricingMD5
	|INTO t_SpecificationRows
	|FROM
	|	t_ItemKeys AS Table
	|		LEFT JOIN Catalog.Specifications.DataSet AS SpecificationsDataSet
	|		ON Table.Specification = SpecificationsDataSet.Ref
	|		AND Table.Key = SpecificationsDataSet.Key
	|		LEFT JOIN Catalog.Specifications.DataQuantity AS SpecificationsDataQuantity
	|		ON Table.Specification = SpecificationsDataQuantity.Ref
	|		AND Table.Key = SpecificationsDataQuantity.Key
	|GROUP BY
	|	Table.ItemKey,
	|	Table.Item,
	|	Table.Specification,
	|	ISNULL(SpecificationsDataQuantity.Quantity, 0),
	|	Table.Key,
	|	Table.PriceType,
	|	Table.AffectPricingMD5
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SpecificationRows.ItemKey AS ItemKey,
	|	SpecificationRows.Specification AS Specification,
	|	SpecificationRows.Item AS Item,
	|	SpecificationRows.PriceType AS PriceType,
	|	SpecificationRows.AffectPricingMD5 AS AffectPricingMD5,
	|	SpecificationRows.Key AS Key,
	|	SpecificationRows.Quantity AS Quantity,
	|	ISNULL(PricesByItemKeysSliceLast.Price,0) AS Price
	|INTO t_PricesByItemKeys
	|FROM
	|	t_SpecificationRows AS SpecificationRows
	|		LEFT JOIN InformationRegister.PricesByItemKeys.SliceLast(&PricePeriod, (ItemKey) IN
	|			(SELECT
	|				T.ItemKey
	|			FROM
	|				t_ItemKeys AS T)) AS PricesByItemKeysSliceLast
	|		ON SpecificationRows.ItemKey = PricesByItemKeysSliceLast.ItemKey
	|		AND SpecificationRows.PriceType = PricesByItemKeysSliceLast.PriceType
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp2.ItemKey AS ItemKey,
	|	tmp2.Specification AS Specification,
	|	tmp2.Item AS Item,
	|	tmp2.PriceType AS PriceType,
	|	tmp2.AffectPricingMD5 AS AffectPricingMD5,
	|	tmp2.Key AS Key,
	|	tmp2.Quantity AS Quantity
	|INTO tmp2
	|FROM
	|	t_PricesByItemKeys AS tmp2
	|WHERE
	|	tmp2.Price = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PriceKeys.Ref AS PriceKey,
	|	Table.ItemKey AS ItemKey,
	|	Table.Specification AS Specification,
	|	Table.Quantity AS Quantity,
	|	Table.AffectPricingMD5 AS AffectPricingMD5,
	|	Table.PriceType AS PriceType,
	|	Table.Key AS Key,
	|	Table.Item AS Item
	|INTO t_PriceKeys
	|FROM
	|	tmp2 AS Table
	|		LEFT JOIN Catalog.PriceKeys AS PriceKeys
	|		ON Table.AffectPricingMD5 = PriceKeys.AffectPricingMD5
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.PriceKey AS PriceKey,
	|	Table.ItemKey AS ItemKey,
	|	Table.Specification AS Specification,
	|	Table.Quantity AS Quantity,
	|	Table.AffectPricingMD5 AS AffectPricingMD5,
	|	Table.Key AS Key,
	|	Table.Item AS Item,
	|	Table.PriceType,
	|	ISNULL(PricesByPropertiesSliceLast.Price,0) * Table.Quantity AS Price
	|INTO t_PricesByProperties
	|FROM
	|	t_PriceKeys AS Table
	|		LEFT JOIN InformationRegister.PricesByProperties.SliceLast(&PricePeriod, (PriceKey) IN
	|			(SELECT
	|				T.PriceKey
	|			FROM
	|				t_PriceKeys AS T)) AS PricesByPropertiesSliceLast
	|		ON Table.PriceKey = PricesByPropertiesSliceLast.PriceKey
	|		AND Table.PriceType = PricesByPropertiesSliceLast.PriceType
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp3.PriceKey AS PriceKey,
	|	tmp3.ItemKey AS ItemKey,
	|	tmp3.Specification AS Specification,
	|	tmp3.Quantity AS Quantity,
	|	tmp3.AffectPricingMD5 AS AffectPricingMD5,
	|	tmp3.Key AS Key,
	|	tmp3.Item AS Item,
	|	tmp3.PriceType AS PriceType
	|INTO tmp3
	|FROM
	|	t_PricesByProperties AS tmp3
	|WHERE
	|	tmp3.Price = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.ItemKey AS ItemKey,
	|	Table.Specification AS Specification,
	|	Table.Quantity AS Quantity,
	|	Table.AffectPricingMD5 AS AffectPricingMD5,
	|	Table.Key AS Key,
	|	Table.Item AS Item,
	|	Table.PriceType AS PriceType,
	|	ISNULL(PricesByItemsSliceLast.Price, 0) * Table.Quantity AS Price
	|INTO t_PricesByItems
	|FROM
	|	tmp3 AS Table
	|		LEFT JOIN InformationRegister.PricesByItems.SliceLast(&PricePeriod, (Item) IN
	|			(SELECT
	|				T.Item
	|			FROM
	|				t_ItemKeys AS T)) AS PricesByItemsSliceLast
	|		ON Table.Item = PricesByItemsSliceLast.Item
	|		AND Table.PriceType = PricesByItemsSliceLast.PriceType
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SpecificationRows.ItemKey AS ItemKey,
	|	SpecificationRows.Item AS Item,
	|	SpecificationRows.PriceType AS PriceType,
	|	ISNULL(t_PricesByItemKeys.Price, 0) AS PriceByItemKeys,
	|	ISNULL(t_PricesByProperties.Price, 0) AS PriceByProperties,
	|	ISNULL(t_PricesByItems.Price, 0) AS PriceByItems
	|INTO t_PriceDetails
	|FROM
	|	t_SpecificationRows AS SpecificationRows
	|		LEFT JOIN t_PricesByItemKeys AS t_PricesByItemKeys
	|		ON SpecificationRows.ItemKey = t_PricesByItemKeys.ItemKey
	|		AND SpecificationRows.PriceType = t_PricesByItemKeys.PriceType
	|		AND SpecificationRows.AffectPricingMD5 = t_PricesByItemKeys.AffectPricingMD5
	|		AND t_PricesByItemKeys.Price <> 0
	|		AND SpecificationRows.Key = t_PricesByItemKeys.Key
	|		LEFT JOIN t_PricesByProperties AS t_PricesByProperties
	|		ON SpecificationRows.ItemKey = t_PricesByProperties.ItemKey
	|		AND SpecificationRows.PriceType = t_PricesByProperties.PriceType
	|		AND SpecificationRows.AffectPricingMD5 = t_PricesByProperties.AffectPricingMD5
	|		AND t_PricesByProperties.Price <> 0
	|		AND SpecificationRows.Key = t_PricesByProperties.Key
	|		LEFT JOIN t_PricesByItems AS t_PricesByItems
	|		ON SpecificationRows.ItemKey = t_PricesByItems.ItemKey
	|		AND SpecificationRows.PriceType = t_PricesByItems.PriceType
	|		AND SpecificationRows.AffectPricingMD5 = t_PricesByItems.AffectPricingMD5
	|		AND t_PricesByItems.Price <> 0
	|		AND SpecificationRows.Key = t_PricesByItems.Key
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	"""" AS PriceDefinitionType,
	|	t_PriceDetails.ItemKey AS PriceDefinitionReason,
	|	t_PriceDetails.Item AS Item,
	|	t_PriceDetails.ItemKey AS ItemKey,
	|	t_PriceDetails.PriceType AS PriceType,
	|	MAX(t_PriceDetails.PriceByItemKeys) + SUM(t_PriceDetails.PriceByProperties) + SUM(t_PriceDetails.PriceByItems) AS
	|		Price
	|into tmp_Specification
	|FROM
	|	t_PriceDetails AS t_PriceDetails
	|GROUP BY
	|	t_PriceDetails.Item,
	|	t_PriceDetails.ItemKey,
	|	t_PriceDetails.PriceType
	|HAVING
	|	MAX(t_PriceDetails.PriceByItemKeys) + SUM(t_PriceDetails.PriceByProperties) + SUM(t_PriceDetails.PriceByItems)
	|		<> 0 ";
EndFunction

Function GetQueryTextForNotSpecifications()
	Return
	"
	|DROP t_ItemKeys;
	|DROP t_PriceKeys;
	|DROP t_PricesByItemKeys;
	|DROP t_PricesByProperties;
	|DROP t_PricesByItems;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.ItemKey AS ItemKey,
	|	Table.Item AS Item,
	|	Table.Specification AS Specification,
	|	Table.AffectPricingMD5 AS AffectPricingMD5
	|INTO t_ItemKeys
	|FROM
	|	tmp_ItemKeys AS Table
	|WHERE
	|	Not Table.IsSpecification
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.ItemKey AS ItemKey,
	|	Table.Specification AS Specification,
	|	Table.AffectPricingMD5 AS AffectPricingMD5,
	|	Table.Item AS Item,
	|	PricesByItemKeysSliceLast.PriceType AS PriceType,
	|	PricesByItemKeysSliceLast.Price AS Price
	|INTO t_PricesByItemKeys
	|FROM
	|	t_ItemKeys AS Table
	|		INNER JOIN InformationRegister.PricesByItemKeys.SliceLast(&PricePeriod, (ItemKey) IN
	|			(SELECT
	|				T.ItemKey
	|			FROM
	|				t_ItemKeys AS T)) AS PricesByItemKeysSliceLast
	|		ON Table.ItemKey = PricesByItemKeysSliceLast.ItemKey
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	PriceKeys.Ref AS PriceKey,
	|	Table.ItemKey AS ItemKey,
	|	Table.AffectPricingMD5 AS AffectPricingMD5,
	|	Table.Item AS Item
	|INTO t_PriceKeys
	|FROM
	|	t_ItemKeys AS Table
	|		LEFT JOIN Catalog.PriceKeys AS PriceKeys
	|		ON Table.AffectPricingMD5 = PriceKeys.AffectPricingMD5
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceKey AS PriceKey,
	|	Table.Item AS Item,
	|	PricesByPropertiesSliceLast.PriceType AS PriceType,
	|	PricesByPropertiesSliceLast.Price AS Price
	|INTO t_PricesByProperties
	|FROM
	|	t_PriceKeys AS Table
	|		INNER JOIN InformationRegister.PricesByProperties.SliceLast(&PricePeriod, (PriceKey) IN
	|			(SELECT
	|				T.PriceKey
	|			FROM
	|				t_PriceKeys AS T)) AS PricesByPropertiesSliceLast
	|		ON Table.PriceKey = PricesByPropertiesSliceLast.PriceKey
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Table.ItemKey AS ItemKey,
	|	Table.Item AS Item,
	|	PricesByItemsSliceLast.PriceType AS PriceType,
	|	PricesByItemsSliceLast.Price AS Price
	|INTO t_PricesByItems
	|FROM
	|	t_ItemKeys AS Table
	|		INNER JOIN InformationRegister.PricesByItems.SliceLast(&PricePeriod, (Item) IN
	|			(SELECT
	|				T.Item
	|			FROM
	|				t_ItemKeys AS T)) AS PricesByItemsSliceLast
	|		ON Table.Item = PricesByItemsSliceLast.Item
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	&ByItemKeys AS PriceDefinitionType,
	|	Table.ItemKey AS PriceDefinitionReason,
	|	Table.Item AS Item,
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceType AS PriceType,
	|	MAX(Table.Price) AS Price
	|into tmp_NotSpecification
	|FROM
	|	t_PricesByItemKeys AS Table
	|GROUP BY
	|	Table.Item,
	|	Table.ItemKey,
	|	Table.PriceType
	|
	|UNION ALL
	|
	|SELECT
	|	&ByProperties AS PriceDefinitionType,
	|	MAX(Table.PriceKey) AS PriceDefinitionReason,
	|	Table.Item AS Item,
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceType AS PriceType,
	|	MAX(Table.Price)
	|FROM
	|	t_PricesByProperties AS Table
	|GROUP BY
	|	Table.Item,
	|	Table.ItemKey,
	|	Table.PriceType
	|
	|UNION ALL
	|
	|SELECT
	|	&ByItems AS PriceDefinitionType,
	|	Table.Item AS PriceDefinitionReason,
	|	Table.Item AS Item,
	|	Table.ItemKey AS ItemKey,
	|	Table.PriceType AS PriceType,
	|	MAX(Table.Price)
	|FROM
	|	t_PricesByItems AS Table
	|GROUP BY
	|	Table.Item,
	|	Table.ItemKey,
	|	Table.PriceType";
EndFunction
